tutorials/simpleDarcyFoam_3D/0/K
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 0 0 0 0 0];

internalField   nonuniform List<tensor> 
64000
(
(4.16165e-05 0 0 0 4.16165e-05 0 0 0 4.16165e-05)
(9.75357e-05 0 0 0 9.75357e-05 0 0 0 9.75357e-05)
(5.49277e-05 0 0 0 5.49277e-05 0 0 0 5.49277e-05)
(0.00343835 0 0 0 0.00343835 0 0 0 0.00343835)
(5.24039e-05 0 0 0 5.24039e-05 0 0 0 5.24039e-05)
(1.26301e-05 0 0 0 1.26301e-05 0 0 0 1.26301e-05)
(2.53534e-05 0 0 0 2.53534e-05 0 0 0 2.53534e-05)
(2.92634e-06 0 0 0 2.92634e-06 0 0 0 2.92634e-06)
...
)
;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
