tutorials/simpleDarcyFoam_3D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./createMesh.sh
runApplication simpleDarcyFoam
